a = "Заяц"
b = "Парту"
c = "Ветер"
t = input("Шубка серая для лета, Для зимы — другого цвета:")
while t != a:
    e = input("Неправильно,попробуйте еще раз:")
    if e == a:
        break
y = input("Я готов к учебным стартам,Скоро сяду я за…")
while t != b:
    u = input("Неправильно,попробуйте еще раз:")
    if u == b:
        break
i = input("Без рук, без ног, А ворота открывает.")
while t != c:
    o = input("Неправильно,попробуйте еще раз:")
    if o == c:
        print("Молодец! Ты решил правильно все загадки")
        break